DataProcessors/ОтражениеДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОтражениеДокументовВБухгалтерии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПубличныеИдентификаторыБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыБухгалтерии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПравилаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиОтражения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриПроверке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Множественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеИдентификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиОтраженияДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиОтраженияДокументовВБухгалтерии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтражения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОтражениеДокументовВБухгалтерии/Forms/ЖурналОтраженияДокументов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МоментОткрытияФормы = ТекущаяДатаСеанса();
	ТекущаяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(ТекущаяНастройка);
	
	СсылкаНаДокумент = Неопределено;
	Отборы = Неопределено;
	
	КонтекстноеОткрытие = Параметры.Свойство("ПереходКДокументу", СсылкаНаДокумент)
		Или Параметры.Свойство("Отборы", Отборы);
	
	ПодготовитьСписокДокументов(ОписаниеНастройки);
	
	// УНФ.ОтборыСписка
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	
	Если КонтекстноеОткрытие Тогда
		Если Отборы <> Неопределено Тогда
			Отборы.Свойство("Период", ОтборПериод);
			
			Если Отборы.Свойство("Организации")
				И Отборы.Организации.Количество() > 0 Тогда
				РаботаСОтборами.ПрикрепитьМеткиОтбораИзМассива(ЭтотОбъект, "Организация", "ГруппаОтборОрганизация", Отборы.Организации);
				РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокДокументов, "Организация");
			КонецЕсли;
			Если Отборы.Свойство("РазделыУчета")
				И Отборы.РазделыУчета.Количество() > 0 Тогда
				РаботаСОтборами.ПрикрепитьМеткиОтбораИзМассива(ЭтотОбъект, "РазделУчета", "ГруппаМетокОтборРазделУчета", Отборы.РазделыУчета);
				РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокДокументов, "РазделУчета");
			КонецЕсли;
		КонецЕсли;
		
		РаботаСОтборами.ОбновитьЭлементыМеток(ЭтотОбъект);
		РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	Иначе
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, СписокДокументов);
	КонецЕсли;
	
	ЗаполнитьСписокВыбораОтборРазделУчета(ОписаниеНастройки);
	ЗаполнитьСписокВыбораОтборОрганизация(ОписаниеНастройки);
	ЗаполнитьСписокВыбораОтборСтатус();
	ЗаполнитьСписокВыбораОтборТипДокумента(ОписаниеНастройки);
	ЗаполнитьСписокВыбораОтборОтражениеВБизнесе();
	ЗаполнитьСписокВыбораОтборОтражениеВБухгалтерии();
	
	УстановитьГруппировкуМетокПредопределенныхОтборов();
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	// Конец УНФ.ОтборыСписка

	НастройкиУзлаОбмена = Справочники.НастройкиОтраженияДокументовВБухгалтерии.НастройкиУзлаОбмена();
	УзелОбмена = НастройкиУзлаОбмена.УзелОбмена;       
	НастройкиБухгалтерии = НастройкиУзлаОбмена.НастройкиПриложения;
	Если ЗначениеЗаполнено(НастройкиБухгалтерии) Тогда
		НастройкиПриложения = ОбщегоНазначения.JSONВЗначение(НастройкиБухгалтерии, , Ложь);       
	КонецЕсли;     
	
	СписокОтражаемыхОрганизаций = Справочники.НастройкиОтраженияДокументовВБухгалтерии.СписокОтражаемыхОрганизаций();
	Если СписокОтражаемыхОрганизаций.Количество() = 1 Тогда  
		Элементы.ОтборОрганизация.Видимость = Ложь;
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;     
	
	Элементы.ГруппаОтборПоДокументу.Видимость = ЗначениеЗаполнено(СсылкаНаДокумент);  
	
	ОписаниеСостояния = ТекущееСостояниеВыполненияОтражения(УзелОбмена, Ложь);
	
	ТекущееСостояниеОбмена   = ОписаниеСостояния.Состояние;
	ТекущееСостояниеСценария = ОписаниеСостояния.СостояниеСценария;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеСостоянияВыполненияОтражения(Ложь);
	
	ПодключитьОбработчикОжидания("ОбработкаОжиданияОбновленияСостоянияОтражения", 60, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И Не КонтекстноеОткрытие Тогда
		СохранитьНастройкиОтборовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытаФормаУзлаПланаОбмена" Тогда   
		ОбновитьКомпоновкуСпискаДокументов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "СписокДокументов", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСписка()
	
	ТекущаяСтрокаСписка = Элементы.СписокДокументов.ТекущаяСтрока;
	
	Элементы.СписокДокументов.Обновить();
	
	Если Элементы.СписокДокументов.ПроверитьСтроку(ТекущаяСтрокаСписка) = Истина Тогда
		АктивизироватьСтрокуСписка(ТекущаяСтрокаСписка);
	Иначе
		АктивизироватьСтрокуСписка();
	КонецЕсли;
	
	ПоказатьПодробнуюИнформациюПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов(Элемент)
	
	НовоеЗначениеВидимость = Не Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборРазделУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("РазделУчета", "ГруппаМетокОтборРазделУчета", ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("Статус", "ГруппаМетокОтборСтатус", ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("ТипДокумента", Элемент.Родитель.Имя, ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтражениеВБизнесеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("ОтраженВБизнесе", "ГруппаМетокОтборОтражениеВБизнесе", ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтражениеВБухгалтерииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	
	УстановитьМеткуИОтборСписка("ОтраженВБухгалтерии", "ГруппаМетокОтборОтражениеВБухгалтерии", ЭлементСписка.Значение, ЭлементСписка.Представление);
	
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновитьДанныеМонитора(Команда)
	
	Элементы.КомандаОбновитьДанныеМонитора.Доступность = Ложь;
	
	НачатьОбновлениеДанныхЖурнала();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "СписокДокументов", "Дата");
	СброситьВсеМеткиОтбораНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтражениеДокументов(Команда)
	
	ОбновитьОтображениеСостоянияВыполненияОтражения(Истина, Истина);
	
КонецПроцедуры   

&НаКлиенте
Процедура ВосстановитьОтражениеДокументов(Команда)
	ВосстановитьОтражениеДокументовНаСервере();    
	ОбновитьОтображениеСостоянияВыполненияОтражения(Истина);
КонецПроцедуры  

 &НаКлиенте
Процедура КомандаПерейтиВЖурналРегистрации(Команда)   

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачала", НачалоДня(МоментОткрытияФормы));
	ПараметрыФормы.Вставить("ДатаОкончания", КонецДня(МоментОткрытияФормы));
	ПараметрыФормы.Вставить("Уровень", "Ошибка");
	ПараметрыФормы.Вставить("ЗапускатьНеВФоне", Истина);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);  
	
	Закрыть();

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаБизнеса = Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ссылка;
	
	Если ЗначениеЗаполнено(СсылкаБизнеса) Тогда
	    ПоказатьЗначение(, СсылкаБизнеса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПоказатьПодробнуюИнформациюПоДокументу", 0.1, Истина);   
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьПодробнуюИнформациюПоДокументу()
	
	ДанныеСтроки = Элементы.СписокДокументов.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		СформироватьТекстПодробнойИнформации(ДанныеСтроки);
		Возврат;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура("Ссылка,Идентификатор_Бухгалтерия,ИдентификаторМетаданных_Бухгалтерия,ОтраженВБухгалтерии,ОтраженВБизнесе,Множественный,СвязанныеИдентификаторы");
	ЗаполнитьЗначенияСвойств(СтруктураДанные, ДанныеСтроки);
	
	ПоказатьПодробнуюИнформациюПоДокументуНаСервере(СтруктураДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьПодробнуюИнформациюПоДокументуНаСервере(ДанныеСтроки)
	
	ДокументЕстьВБизнесе = ЗначениеЗаполнено(ДанныеСтроки.Ссылка);
	ДокументЕстьВБухгалтерии = ЗначениеЗаполнено(ДанныеСтроки.Идентификатор_Бухгалтерия);
	
	СтрокиИнформации = СоздатьСтрокиИнформации();
	
	Если ДанныеСтроки.Множественный Тогда       
		
		Если ДокументЕстьВБизнесе Тогда
			ДобавитьСтрокуИнформации(СтрокиИнформации, "СсылкаБизнеса", Строка(ДанныеСтроки.Ссылка), ДанныеСтроки.Ссылка);
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(ДанныеСтроки.СвязанныеИдентификаторы) Тогда
			СвязанныеИдентификаторы = ОбщегоНазначения.JSONВЗначение(ДанныеСтроки.СвязанныеИдентификаторы, , Ложь);       
			МассивДокументовБухгалтерии = Новый Массив;
			Для Каждого СтрокаИдентификатора Из СвязанныеИдентификаторы Цикл  
				ОписаниеОбъекта = СовместноеИспользованиеПереопределяемый.ОписаниеОбъектаБухгалтерии(СтрокаИдентификатора.Идентификатор, СтрокаИдентификатора.ИдентификаторМетаданных);
				МассивДокументовБухгалтерии.Добавить(ОписаниеОбъекта);
			КонецЦикла;      
		Иначе 
			МассивДокументовБухгалтерии = СовместноеИспользованиеПереопределяемый.СведенияОПарныхДокументахПоДокументуБизнеса(ДанныеСтроки.Ссылка, УзелОбмена);     
		КонецЕсли;

		ВсеПроведены = Истина;
		ВсеНеПроведены = Истина;
		МассивЗначений = Новый Массив;      
		ЕстьОшибки = Ложь;
		ОшибкиВыведены = Ложь;
		Для Каждого ОписаниеОбъекта Из МассивДокументовБухгалтерии Цикл   
			ВнешняяСсылка = СовместноеИспользование.НавигационнаяСсылкаВнешнегоПриложения(ОписаниеОбъекта.НавигационнаяСсылка, "БухгалтерияПредприятия");
			ДобавитьСтрокуИнформации(СтрокиИнформации, "СсылкаБухгалтерии", ОписаниеОбъекта.Представление, ВнешняяСсылка, ДанныеСтроки.Идентификатор_Бухгалтерия, ДанныеСтроки.ИдентификаторМетаданных_Бухгалтерия);
			
			Если ОписаниеОбъекта.ЕстьОшибкиОтражения Тогда   
				ЕстьОшибки = Истина;  
				Если Не ОшибкиВыведены Тогда
					Для Каждого ОписаниеПроблемы Из ОписаниеОбъекта.ПроблемыПриПроверке Цикл
						ДобавитьСтрокуИнформации(СтрокиИнформации, "Ошибка", ОписаниеПроблемы, ДанныеСтроки.Ссылка);
					КонецЦикла;
				КонецЕсли; 
				ОшибкиВыведены = Истина;
			КонецЕсли; 
			
			ПроведенВБухгалтерии = ОписаниеОбъекта.Проведен;     
			Если ПроведенВБухгалтерии Тогда 
				ВсеНеПроведены = Ложь;
			Иначе  
				ВсеПроведены = Ложь;
			КонецЕсли;
		КонецЦикла;  
		
		Если ВсеПроведены Тогда     
			Если ЕстьОшибки Тогда  
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Есть расхождения с бухгалтерией!'"));      
			Иначе
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ полностью отражен в бухгалтерии.'"));  
			КонецЕсли;
		ИначеЕсли ВсеНеПроведены Тогда
			ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ полностью не отражен в бухгалтерии!'"));
		Иначе
			ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ отражен в бухгалтерии не полностью.'"));  
		КонецЕсли;

	Иначе
		
		Если ДокументЕстьВБухгалтерии Тогда
			ОписаниеОбъекта = СовместноеИспользованиеПереопределяемый.ОписаниеОбъектаБухгалтерии(ДанныеСтроки.Идентификатор_Бухгалтерия, ДанныеСтроки.ИдентификаторМетаданных_Бухгалтерия);
			
			ЕстьОшибки = Ложь;
			Если Не ДанныеСтроки.ОтраженВБухгалтерии Тогда 
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ не отражен в бухгалтерии!'"));      
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если Не ДокументЕстьВБизнесе
				Или Не ДанныеСтроки.ОтраженВБизнесе Тогда
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ не отражен в бизнесе!'"));      
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если ОписаниеОбъекта.ЕстьОшибкиОтражения Тогда   
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Есть расхождения с бухгалтерией!'"));      
				ЕстьОшибки = Истина;
				Для Каждого ОписаниеПроблемы Из ОписаниеОбъекта.ПроблемыПриПроверке Цикл
					ДобавитьСтрокуИнформации(СтрокиИнформации, "Ошибка", ОписаниеПроблемы, ДанныеСтроки.Ссылка);
				КонецЦикла;
			КонецЕсли; 
			
			Если Не ЕстьОшибки Тогда
				ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ отражен в бухгалтерии.'"));      
			КонецЕсли;
			
			Если ДокументЕстьВБизнесе Тогда
				ДобавитьСтрокуИнформации(СтрокиИнформации, "СсылкаБизнеса", Строка(ДанныеСтроки.Ссылка), ДанныеСтроки.Ссылка);
			КонецЕсли;
			ВнешняяСсылка = СовместноеИспользование.НавигационнаяСсылкаВнешнегоПриложения(ОписаниеОбъекта.НавигационнаяСсылка, "БухгалтерияПредприятия");
			
			ДобавитьСтрокуИнформации(СтрокиИнформации, "СсылкаБухгалтерии", ОписаниеОбъекта.Представление, ВнешняяСсылка, ДанныеСтроки.Идентификатор_Бухгалтерия, ДанныеСтроки.ИдентификаторМетаданных_Бухгалтерия);
		Иначе
			ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокОбщий", НСтр("ru = 'Документ отсутствует в бухгалтерии.'"));
			ДобавитьСтрокуИнформации(СтрокиИнформации, "СсылкаБизнеса", Строка(ДанныеСтроки.Ссылка), ДанныеСтроки.Ссылка);
		КонецЕсли;  
	КонецЕсли;  
	
	СовместноеИспользованиеПереопределяемый.ПриВыводеПодробнойИнформации(ДанныеСтроки.Ссылка, СтрокиИнформации);
	СформироватьТекстПодробнойИнформации(ДанныеСтроки, СтрокиИнформации);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстПодробнойИнформации(ДанныеСтроки, Знач СтрокиИнформации = Неопределено)  
	
	Если СтрокиИнформации = Неопределено Тогда
		СтрокиИнформации = СоздатьСтрокиИнформации();
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		ДобавитьСтрокуИнформации(СтрокиИнформации, "Ошибка", НСтр("ru = 'Нет документов за выбранный период.'"));  
	Иначе
		ДобавитьСтрокуИнформации(СтрокиИнформации, "ЗаголовокСсылки", НСтр("ru = 'Для перехода к документам воспользуйтесь ссылками.'"));    
		СтрокиИнформации.Сортировать("Порядок");
	КонецЕсли;

	МассивСтрок = Новый Массив;
	
	ПолужирныйШрифт = Новый Шрифт(,,Истина);
	
	ЦветТекстаПредупреждения = ЦветаСтиля.РезультатПредупреждениеЦвет;
	
	Для Каждого Строка Из СтрокиИнформации Цикл
		Если Строка.Тип = "Ошибка" Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка.Содержание, , ЦветТекстаПредупреждения));
		ИначеЕсли Строка.Тип = "СсылкаБизнеса" Тогда
			ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Бизнес: '"));
			Если ТипЗнч(Строка.Ссылка) = Тип("Строка") Тогда 
				Подстрока = Новый ФорматированнаяСтрока(Строка.Содержание, , , , Строка.Ссылка);     
			Иначе
				Подстрока = Новый ФорматированнаяСтрока(Строка.Содержание, , , , ПолучитьНавигационнуюСсылку(Строка.Ссылка));     
			КонецЕсли;
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЗаголовокСсылки, Подстрока));
		ИначеЕсли Строка.Тип = "СсылкаБухгалтерии" Тогда
			ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Бухгалтерия: '"));
			Подстрока = Новый ФорматированнаяСтрока(Строка.Содержание, , , , Строка.Ссылка);     
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЗаголовокСсылки, Подстрока));
		ИначеЕсли Строка.Тип = "ЗаголовокОбщий" Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка.Содержание, ПолужирныйШрифт)); 
		ИначеЕсли Строка.Тип = "ЗаголовокСсылки" Тогда
			МассивСтрок.Добавить("");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка.Содержание, ПолужирныйШрифт)); 
		КонецЕсли;
	КонецЦикла;

	ПолеДетальнаяИнформация = ФорматированнаяСтрокаИзМассиваСтрок(МассивСтрок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФорматированнаяСтрокаИзМассиваСтрок(МассивСтрок)
	
	МассивСтрокСРазделителями = Новый Массив;
	
	Для Инд = 0 По Мин(0, МассивСтрок.ВГраница()) Цикл
		МассивСтрокСРазделителями.Добавить(МассивСтрок[Инд]);
	КонецЦикла;
	
	Для Инд = 1 По МассивСтрок.ВГраница() Цикл
		МассивСтрокСРазделителями.Добавить(Символы.ПС);
		МассивСтрокСРазделителями.Добавить(МассивСтрок[Инд]);
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрокСРазделителями);
	
КонецФункции

&НаСервере
Процедура ПодготовитьСписокДокументов(ОписаниеНастройки)
	
	ОтборыЖурнала = Новый Структура;
	ОтборыЖурнала.Вставить("Период", Новый СтандартныйПериод);
	ОтборыЖурнала.Вставить("Организации", Новый Массив);
	ОтборыЖурнала.Вставить("ТипыДокумента", Новый Массив);
	ОтборыЖурнала.Вставить("РазделыУчета", ОписаниеНастройки.РазделыУчета);
	ОтборыЖурнала.Вставить("Статусы", Новый Массив);
	ОтборыЖурнала.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
	
	ОписаниеЗапроса = Обработки.ОтражениеДокументовВБухгалтерии.ОписаниеЗапросаДетальныхЗаписейОтраженияДокументов(ОтборыЖурнала);
	
	СписокДокументов.ТекстЗапроса = ОписаниеЗапроса.Текст;
	
	Для Каждого ОписаниеПараметра Из ОписаниеЗапроса.Параметры Цикл
		СписокДокументов.Параметры.УстановитьЗначениеПараметра(ОписаниеПараметра.Ключ, ОписаниеПараметра.Значение);
	КонецЦикла;
	
	Для Каждого ПолеНабора Из СписокДокументов.Поля Цикл
		ПолеНабора.ОграничениеИспользованияРеквизитов.Условие = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьСтрокуСписка(ТекущаяСтрокаСписка = Неопределено)
	
	Элементы.СписокДокументов.ТекущаяСтрока = ТекущаяСтрокаСписка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуИнформации(СтрокиИнформации, Тип, Содержание, Ссылка = Неопределено, Идентификатор = "", ИдентификаторМетаданных = "")
	
	СовместноеИспользование.ДобавитьСтрокуИнформации(СтрокиИнформации, Тип, Содержание, Ссылка, Идентификатор, ИдентификаторМетаданных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьСтрокиИнформации()
	
	СтрокиИнформации = Новый ТаблицаЗначений;
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ТипСтрока = Новый ОписаниеТипов("Строка");   
	ТипСсылкаСтрока = Новый ОписаниеТипов(ТипСтрока, Документы.ТипВсеСсылки().Типы());
	
	СтрокиИнформации.Колонки.Добавить("Тип", ТипСтрока);
	СтрокиИнформации.Колонки.Добавить("Содержание", ТипСтрока);
	СтрокиИнформации.Колонки.Добавить("Ссылка", ТипСсылкаСтрока);
	СтрокиИнформации.Колонки.Добавить("Идентификатор", ТипСтрока);
	СтрокиИнформации.Колонки.Добавить("ИдентификаторМетаданных", ТипСтрока);
	СтрокиИнформации.Колонки.Добавить("Порядок", ТипЧисло); 
	
	Возврат СтрокиИнформации;
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеДанныхЖурнала()
	
	ДлительнаяОперация = ДлительнаяОперацияОбновитьДанныеЖурнала();
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ОбновлениеДанныхЖурналаЗавершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхЖурналаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.КомандаОбновитьДанныеМонитора.Доступность = Истина;
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
		Возврат;
	КонецЕсли; 
	
	ОбновитьДанныеСписка();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияОбновитьДанныеЖурнала()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление данных журнала отражения документов в учете'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"РегистрыСведений.ПубличныеИдентификаторыБухгалтерии.ВыполнитьОбновлениеДанных");
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиОтборовНаСервере()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, Знач ПредставлениеЗначения = "")
	
	Если ПустаяСтрока(ПредставлениеЗначения) Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокДокументов, ИмяПоляОтбораСписка);
	
	УстановитьГруппировкуМетокПредопределенныхОтборов();
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, СписокДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборРазделУчета(ОписаниеНастройки)
	
	Для Каждого СтрокаРаздел Из СовместноеИспользование.ДоступныеРазделыУчета() Цикл
		Если ОписаниеНастройки.РазделыУчета.Найти(СтрокаРаздел.Идентификатор) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ОтборРазделУчета.СписокВыбора.Добавить(СтрокаРаздел.Идентификатор, СтрокаРаздел.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборСтатус()
	
	Элементы.ОтборСтатус.СписокВыбора.Добавить("Отражен", НСтр("ru = 'Отражен'"));
	Элементы.ОтборСтатус.СписокВыбора.Добавить("ЕстьРасхождения", НСтр("ru = 'Есть расхождения'"));
	Элементы.ОтборСтатус.СписокВыбора.Добавить("НеОтражен", НСтр("ru = 'Не отражен'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборТипДокумента(ОписаниеНастройки)
	
	ТаблицаИсточники = Новый ТаблицаЗначений;
	ТаблицаИсточники.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("Строка"));
	
	ИсточникиДанных = СовместноеИспользование.ИсточникиДанныхСинхронизируемыхОбъектов();
	Для Каждого Источник Из ИсточникиДанных Цикл
		Если ОписаниеНастройки.РазделыУчета.Найти(Источник.ИдентификаторРаздела) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТисточники = ТаблицаИсточники.Добавить();
		СтрокаТисточники.ТипДокумента = Строка(Источник.ТипСсылки);
	КонецЦикла;
	
	ТаблицаИсточники.Сортировать("ТипДокумента");
	Элементы.ОтборТипДокумента.СписокВыбора.ЗагрузитьЗначения(ТаблицаИсточники.ВыгрузитьКолонку("ТипДокумента"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборОтражениеВБизнесе()
	
	Элементы.ОтборОтражениеВБизнесе.СписокВыбора.Добавить(Истина, НСтр("ru = 'Отражен'"));
	Элементы.ОтборОтражениеВБизнесе.СписокВыбора.Добавить(Ложь, НСтр("ru = 'Не отражен'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборОтражениеВБухгалтерии()
	
	Элементы.ОтборОтражениеВБухгалтерии.СписокВыбора.Добавить(Истина, НСтр("ru = 'Отражен'"));
	Элементы.ОтборОтражениеВБухгалтерии.СписокВыбора.Добавить(Ложь, НСтр("ru = 'Не отражен'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОкончаниеВыбора(Список, ДополнительныеПараметры) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	ЧисловойИдентификаторМетки = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МеткаИД);
	СтрокаМеток = ДанныеМеток.НайтиПоИдентификатору(ЧисловойИдентификаторМетки);
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, СписокДокументов, МеткаИД);
	
	УстановитьГруппировкуМетокПредопределенныхОтборов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппировкуМетокПредопределенныхОтборов()
	
	Элементы.ГруппаМетокОтборСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.ГруппаМетокОтборРазделУчета.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.ГруппаМетокОтборОтражениеВБизнесе.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.ГруппаМетокОтборОтражениеВБухгалтерии.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияОбновленияСостоянияОтражения()
	
	ОбновитьОтображениеСостоянияВыполненияОтражения();
	
	ПодключитьОбработчикОжидания("ОбработкаОжиданияОбновленияСостоянияОтражения", 60, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеСостоянияВыполненияОтражения(ОбновитьТекущееСостояние = Истина, ЗапланироватьОбмен = Ложь)
	
	Если ОбновитьТекущееСостояние Тогда
		ОписаниеСостояния = ТекущееСостояниеВыполненияОтражения(УзелОбмена, ЗапланироватьОбмен);
		
		ТекущееСостояниеОбмена   = ОписаниеСостояния.Состояние;
		ТекущееСостояниеСценария = ОписаниеСостояния.СостояниеСценария;
		
		Если ОписаниеСостояния.ДлительнаяОперация <> Неопределено Тогда
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
			ДлительныеОперацииКлиент.ОжидатьЗавершение(
				ОписаниеСостояния.ДлительнаяОперация,
				Новый ОписаниеОповещения("ВыполнитьСценарийСинхронизацииДанныхЗавершение", ЭтотОбъект),
				ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущееСостояниеОбмена = "ВыполняетсяОтражение" Тогда
		Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеВыполняетсяОтражение;
	Иначе
		Если ТекущееСостояниеСценария = "ОтключенАвтоматически" Тогда
			Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеСценарияОтражениеОтключено;
		ИначеЕсли ТекущееСостояниеСценария = "НетЗапускаПоРасписанию" Тогда
			Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеСценарияОтражениеОтключено;
		ИначеЕсли ТекущееСостояниеСценария = "НеНастроен" Тогда
			Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеСценарияНеНастроен;
		Иначе
			Если ТекущееСостояниеОбмена = "ВсеДокументыОтражены" Тогда
				Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеВсеДокументыОтражены;
			ИначеЕсли ТекущееСостояниеОбмена = "ЕстьДокументыДляОтражения" Тогда
				Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеЕстьДокументыДляОтражения;
			Иначе
				Элементы.ПанельСостоянияОтраженияДокументов.ТекущаяСтраница = Элементы.СтраницаСостояниеПустое;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСценарийСинхронизацииДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Задание отменено.'"));
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));
	КонецЕсли;
	
	ОбновитьОтображениеСостоянияВыполненияОтражения(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущееСостояниеВыполненияОтражения(Узел, ЗапланироватьОбмен)
	
	Результат = Новый Структура;
	Результат.Вставить("Состояние", ""); // "ВыполняетсяОтражение", "ЕстьДокументыДляОтражения", "ВсеДокументыОтражены"
	Результат.Вставить("СостояниеСценария", ""); // "НеНастроен", "ОтключенАвтоматически", "НетЗапускаПоРасписанию", "Настроен"
	Результат.Вставить("ДлительнаяОперация", Неопределено);
	
	УстановитьПривилегированныйРежим(Истина);
	ОбменЗапланирован = ОбменДаннымиВнутренняяПубликация.ПоУзлуЗапланированОбмен(Узел);
	ОписаниеСценария = Обработки.ОтражениеДокументовВБухгалтерии.ОсновнойСценарийСинхронизации(Узел);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОписаниеСценария = Неопределено Тогда
		Результат.СостояниеСценария = "НеНастроен";
	Иначе
		Если ОписаниеСценария.ОтключенАвтоматически Тогда
			Результат.СостояниеСценария = "ОтключенАвтоматически";
		ИначеЕсли Не ОписаниеСценария.ИспользоватьРегламентноеЗадание Тогда
			Результат.СостояниеСценария = "НетЗапускаПоРасписанию";
		Иначе
			Результат.СостояниеСценария = "Настроен";
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменЗапланирован Тогда
		Результат.Состояние = "ВыполняетсяОтражение";
	Иначе
		Если ЗапланироватьОбмен
			И ОписаниеСценария <> Неопределено
			И Не ОписаниеСценария.ОтключенАвтоматически Тогда
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Ручной запуск выполнения сценария синхронизации данных'");
			
			Результат.Состояние = "ВыполняетсяОтражение";
			Результат.ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
				ПараметрыВыполнения,
				"Обработки.ОтражениеДокументовВБухгалтерии.ВыполнитьСценарийСинхронизацииДанных",
				ОписаниеСценария.Ссылка);
		Иначе
			Если ЕстьЗарегистрированныеДокументы(Узел) Тогда
				Результат.Состояние = "ЕстьДокументыДляОтражения";
			Иначе
				Результат.Состояние = "ВсеДокументыОтражены";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЗарегистрированныеДокументы(Узел)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоставПланаОбмена = Узел.Метаданные().Состав;
	
	ШаблонЗапросаИзменений = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаИзменений.Ссылка КАК Ссылка,
	|	ТаблицаИзменений.Узел КАК Узел
	|ИЗ
	|	#ИмяТаблицыМетаданных КАК ТаблицаИзменений
	|ГДЕ
	|	ТаблицаИзменений.Узел = &Узел";
	
	НаборЗапросовИзменений = Новый Массив;
	
	Для Каждого ЭлементСостава Из СоставПланаОбмена Цикл
		Если Не ОбщегоНазначения.ЭтоДокумент(ЭлементСостава.Метаданные) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицыМетаданных = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Изменения", ЭлементСостава.Метаданные.ПолноеИмя());
		ТекстЗапроса = СтрЗаменить(ШаблонЗапросаИзменений, "#ИмяТаблицыМетаданных", ИмяТаблицыМетаданных);
		
		НаборЗапросовИзменений.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	Если НаборЗапросовИзменений.Количество() > 0 Тогда
		СтрокаОбъединения = "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
		ТекстЗапросаИзменений = СтрСоединить(НаборЗапросовИзменений, СтрокаОбъединения);
		
		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаИзменений.Ссылка КАК Ссылка
		|ИЗ
		|	#ПодзапросИзмененияДанных КАК ТаблицаИзменений";
		
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "#ПодзапросИзмененияДанных", "(" + ТекстЗапросаИзменений + ")");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Узел", Узел);
		
		Возврат Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборОрганизация(ОписаниеНастройки)
	
	Элементы.ОтборОрганизация.СписокВыбора.ЗагрузитьЗначения(ОписаниеНастройки.Организации);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьОтражениеДокументовНаСервере()

	ОписаниеСценария = Обработки.ОтражениеДокументовВБухгалтерии.ОсновнойСценарийСинхронизации(УзелОбмена);
	Если ОписаниеСценария.ОтключенАвтоматически Тогда        
		СценарийОбъект = ОписаниеСценария.Ссылка.ПолучитьОбъект();    
		СценарийОбъект.ИспользоватьРегламентноеЗадание = Истина;
		
		// Актуализируем регламентное задание.  
		Отказ = Ложь;
		Справочники.СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, Неопределено,  СценарийОбъект);
		Если Не Отказ Тогда
			СценарийОбъект.Записать();       
		Иначе
			ВызватьИсключение НСтр("ru = 'Ошибка при восстановлении сценария отражения'");
		КонецЕсли;
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомпоновкуСпискаДокументов()

	ТекущаяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(ТекущаяНастройка);
	ПодготовитьСписокДокументов(ОписаниеНастройки);
	
КонецПроцедуры

#КонецОбласти
